Revit 2026 API

# MEPSystemConnectorManager Property

---

Connector manager of the system.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ConnectorManager ConnectorManager { get; }
```
```vb
Public ReadOnly Property ConnectorManager As ConnectorManager
	Get
```
```cpp
public:
property ConnectorManager^ ConnectorManager {
	ConnectorManager^ get ();
}
```
```fsharp
member ConnectorManager : ConnectorManager with get
```

#### Property Value

ConnectorManager

The connector manager includes connectors which are used to connect with terminal elements and base equipment.

#### Reference

MEPSystem Class

Autodesk.Revit.DB Namespace